In [1]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt 
import seaborn as sns

In [2]:
df = sns.load_dataset("titanic")

In [3]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [5]:
#taking categorical feature; chi square works on categorical features.
df = df[['sex', 'embarked', 'alone', 'pclass', 'survived']]
df.head()

      sex embarked  alone  pclass  survived
0    male        S  False       3         0
1  female        C  False       1         1
2  female        S   True       3         1
3  female        S  False       1         1
4    male        S   True       3         0

In [6]:
#perform labelencodig
df['sex'] = np.where(df['sex']=="male", 1, 0)
embarked_label = {k: i for i, k in enumerate(df['embarked'].unique(), 0)}
df['embarked'] = df['embarked'].map(embarked_label)

In [7]:
df.head()

   sex  embarked  alone  pclass  survived
0    1         0  False       3         0
1    0         1  False       1         1
2    0         0   True       3         1
3    0         0  False       1         1
4    1         0   True       3         0

In [8]:
df['alone'] = np.where(df['alone']==True, 1, 0)

In [9]:
df.head()

   sex  embarked  alone  pclass  survived
0    1         0      0       3         0
1    0         1      0       1         1
2    0         0      1       3         1
3    0         0      0       1         1
4    1         0      1       3         0

In [10]:
x = df.drop('survived', axis=1)
y = df['survived']

In [11]:
x, y

(     sex  embarked  alone  pclass
 0      1         0      0       3
 1      0         1      0       1
 2      0         0      1       3
 3      0         0      0       1
 4      1         0      1       3
 ..   ...       ...    ...     ...
 886    1         0      1       2
 887    0         0      1       1
 888    0         0      0       3
 889    1         1      1       1
 890    1         2      1       3

 [891 rows x 4 columns],
 0      0
 1      1
 2      1
 3      1
 4      0
       ..
 886    0
 887    1
 888    0
 889    1
 890    0
 Name: survived, Length: 891, dtype: int64)

In [13]:
from sklearn.feature_selection import chi2
f_score, p_value = chi2(x, y)

In [14]:
f_score, p_value

(array([92.70244698, 14.12425688, 14.64079273, 30.87369944]),
 array([6.07783826e-22, 1.71122816e-04, 1.30068490e-04, 2.75378563e-08]))

In [15]:
p_value = pd.Series(p_value)

In [16]:
p_value

0    6.077838e-22
1    1.711228e-04
2    1.300685e-04
3    2.753786e-08
dtype: float64

In [17]:
#greater value of f_score and small value of p value greater the importance of feature

In [18]:
#we can see that sex feature is most important